---
kind: method
id: M:Autodesk.Revit.DB.ParameterFilterElement.ClearRules
source: html/c6ad088a-38c2-8d3f-947a-83fe0dff11eb.htm
---
# Autodesk.Revit.DB.ParameterFilterElement.ClearRules Method

Removes all rules from this filter.

## Syntax (C#)
```csharp
public void ClearRules()
```